#============================================================
# 環境変数の定義
#============================================================
# プロジェクト名
variable "project_name" {}
#============================================================
# AWS Account
#============================================================
# AWSのリージョン
variable "region" {}
# AWSアクセスキーのプロファイル
variable "profile" {}
#============================================================
# Route53
#============================================================
# Route53で事前に取得済みのドメイン名
variable "route53_domain" {}
#============================================================
# Cognito
#============================================================
# IDトークンの有効期限(秒)(5分-1日の範囲で指定)
variable "cognito_id_token_validity" {}
# アクセストークンの有効期限(秒)(5分-1日の範囲で指定)
variable "cognito_access_token_validity" {}
# リフレッシュトークンの有効期限(秒)
# 60分-10年の範囲で指定, IDトークン/アクセストークンよりも長い時間を指定すること
variable "cognito_refresh_token_validity" {}
# メールの送信元アドレス
variable "from_email_address" {}
#============================================================
# Lambda
#============================================================
# 実行ランタイム（ex: nodejs, python, go, etc.）
variable "lambda_runtime" {}
# Lambda関数のタイムアウト時間
variable "lambda_timeout" {}
# CloudWatchにログを残す期間（日）
variable "lambda_cloudwatch_log_retention_in_days" {}
