#============================================================
# 環境変数の定義（terraform.tfvarsの変数値を受け取る）
#============================================================
# プロジェクトID
variable "project_id" {}
# リージョン
variable "region" {}
#============================================================
# Memorystore Redis
#============================================================
# シャード数(最小値:3, 最大値:250(レプリカノード数に依存))
variable "gms_redis_shard_count" {}
# レプリカノード数(最小値:0, 最大値:2)
variable "gms_redis_replica_count" {}
