#============================================================
# 環境変数の定義（terraform.tfvarsの変数値を受け取る）
#============================================================
# プロジェクト名
variable "project_name" {}
#============================================================
# Resource Group
#============================================================
# ロケーション
variable "location" {}
#============================================================
# Blob Storage
#============================================================
# パフォーマンス (Standard/Premium)
variable "storage_account_tier" {}
# 冗長性 (LRS/GRS/RAGRS/ZRS/GZRS/RAGZRS)
variable "storage_account_replication_type" {}
