#============================================================
# 環境変数の定義（terraform.tfvarsの変数値を受け取る）
#============================================================
# プロジェクト名
variable "project_name" {}
#============================================================
# AWS Account
#============================================================
# AWSのリージョン
variable "region" {}
# AWSアクセスキーのプロファイル
variable "profile" {}
#============================================================
# ECS
#============================================================
# ECSで起動するコンテナ名
variable "ecs_container_name" {}
# ECSで起動するイメージ名
variable "ecs_container_image" {}
# ECSで起動するコンテナのvCPU数
variable "ecs_container_vcpu" {}
# ECSで起動するコンテナのメモリサイズ
variable "ecs_container_memory" {}
